spec/fixtures/fastlane_plus_envelope.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <UploadFile xmlns="http://webservices.seek.com.au">
      <Token>token123</Token>
      <xmlFastlaneFile>
        <FastLanePlus UploaderID="111" AgentID="" Version="3.0">
          <Client ID="222" MinJobs="0" MaxJobs="9999999">
            <Job Reference="reference_value" TemplateID="template_id_value" ScreenID="screen_id_value">
  <Title>title_value</Title>
  <SearchTitle>search_title_value</SearchTitle>
  <Description>description_value</Description>
  <AdDetails><![CDATA[ad_details_value]]></AdDetails>
  <ApplicationEmail>application_email_value</ApplicationEmail>
  <ApplicationURL>application_url_value</ApplicationURL>
  <ResidentsOnly>Yes</ResidentsOnly>
  <Items>
    <Item Name="Jobtitle">item_job_title_value</Item>
  </Items>
  <Listing MarketSegments="Main">
    <Classification Name="Location">locACT</Classification>
    <Classification Name="Area">listing_area_value</Classification>
    <Classification Name="WorkType">CasualVacation</Classification>
    <Classification Name="Classification">Accounting</Classification>
    <Classification Name="SubClassification">AccountsOfficersClerks</Classification>
  </Listing>
  <Salary Type="AnnualPackage" Min="50000" Max="69999" AdditionalText="salary_additional_text_value"/>
</Job>
          </Client>
        </FastLanePlus>
      </xmlFastlaneFile>
    </UploadFile>
  </soap:Body>
</soap:Envelope>
